from django.shortcuts import render


def catalog(request):
    res = [
        {
            "image": "source/images/zelenyy-chay-volshebnitsa-44321194930249-removebg-preview.png",
            "name": "Зелений чай «Чарівниця»",
            "description": "Суміш китайського зеленого і білого чаю з додаванням ягід годжі, відомих на Сході як «ягоди безсмертя», родзинок, цедри апельсина, листя ожини і троянди, шматочків малини, квітів граната, білої акації і блакитної мальви, ароматизована натуральними екстрактами бергамоту і малини. Дійсно чарівний чай!",
            "weight": 50,
            "price": 225,
        },
        {
            "image": "source/images/zelenyy-chay-sauasep-51028332101902-removebg-preview.png",
            "name": "Зелений чай «Сауасеп»",
            "description": "Зелений цейлонський чай, ароматизований соком екзотичного фрукта сауасеп - «сметанне яблуко». Аромат цього чаю дуже яскравий, а смак вдало поєднує свіжість зеленого чаю та незвичну терпкість із солодким присмаком.",
            "weight": 50,
            "price": 150,
        },
        {
            "image": "source/images/spetsialnyy-chay-pu-er-67838602676323-removebg-preview.png",
            "name": "«Пу Ер ваговий»",
            "description": "Витриманий Шу Пу Ер з провінції Юннань віком не менше 5 років. Історично склалося так, що зазвичай у Китаї Пу Ери пресують у різні форми і розміри. Ну варто, навіть потрібно, спробувати і ваговий. У розсипному вигляді він швидше дорослішає, смак стає глибшим, аромат посилюється і стає оркестровим. Дуже радимо )",
            "weight": 50,
            "price": 175,
        },
        {
            "image": "source/images/copy_spetsialnyy-chay-pu-er-shu-menkhay-da-i-v93-2015-g.-tuo-cha-100-gr.-92417567306178-removebg-preview.png",
            "name": "«Пу Ер Шу пресований “Лао Вей Дао”",
            "description": "Відмінний витриманий млинець. Спеціальний купаж для любителів Пу Ера зі старим смаком. Те що треба для регулярних чаювань.",
            "weight": 100,
            "price": 300,
        },
        {
            "image": "source/images/chernyy-chay-iskry-shampanskogo-13195572749877-removebg-preview.png",
            "name": "Чорний чай «Іскри шампанського»",
            "description": "Незвичайна суміш чорного і зеленого чаїв з додаванням волошки, а також листя і ягід суниці. Має приємний аромат медового літа, який закрутить Вам голову!",
            "weight": 50,
            "price": 145,
        },
        {
            "image": "source/images/chernyy-chay-zolotoy-unnan-14450018005543-removebg-preview.png",
            "name": "Чорний чай «Золотий Юннань»",
            "description": "Выращивается в южной китайской провинции Юннань, знаменитой своими мягкими и слегка дымными чаями. Чай средней крепости с красновато-золотистым настоем и характерным сладким вкусом.",
            "weight": 50,
            "price": 225,
        },
        {
            "image": "source/images/belyy-chay-belyy-pion-35710889070447-removebg-preview.png",
            "name": "Білий чай «Біла півонія»",
            "description": "Рідкісний білий китайський чай, який збирають ранньою весною в провінції Фуцзянь на висоті близько 1500 м. Листя не проходить скручування після збору, тільки коротку ферментацію і відразу ж сушиться. Чайні бруньки при цьому зберігають свій сріблястий колір, тому такі чаї називають «білими». При заварюванні дає прозорий настій зі свіжим ароматом і оксамитовим квітковим смаком. Неймовірно тонка насолода!",
            "weight": 50,
            "price": 395,
        },
        {
            "image": "source/images/belyy-chay-serebryanye-igly-bay-khao-74485091841665-removebg-preview.png",
            "name": "Білий чай «Срібні голки Бай Хао»",
            "description": "Цей винятковий білий чай виробляється в провінції Фуцзянь і входить до десятки найкращих чаїв Китаю. Неймовірно трудомісткий у виробництві, під час виготовлення цього чаю використовують тільки найніжніші молоді бруньки, вкриті сріблясто-білими ворсинками. Звідси і висока вартість. Дає блідо-жовтий настій із напрочуд м'яким, солодким смаком.",
            "weight": 50,
            "price": 690,
        },
        {
            "image": "source/images/fruktovaya-smes-zemlyanichnaya-simfoniya-85154328685917-removebg-preview.png",
            "name": "Фруктова суміш «Сунична симфонія»",
            "description": "Натуральная фруктовая смесь на основе каркаде с добавлением кусочков шиповника, яблока, цедры апельсина и лимона, а ягодки земляники – прекрасный и сочный бонус.",
            "weight": 50,
            "price": 150,
        },
        {
            "image": "source/images/fruktovaya-smes-bezumnyy-krolik-31009363773142-removebg-preview.png",
            "name": "Фруктова суміш «Шалений кролик»",
            "description": "Натуральна фруктова суміш на основі пелюсток суданської троянди з додаванням шматочків банана, ягід смородини та бузини, пелюсток календули та цукрових сердечок. Корисний і смачний чай з прекрасним ароматом.",
            "weight": 50,
            "price": 160,
        },
        {
            "image": "source/images/travyanaya-smes-myatnaya-fantaziya-77461840711344-removebg-preview.png",
            "name": "Трав'яна суміш «М'ятна фантазія»",
            "description": "Трав'яна суміш на основі м'яти з додаванням пелюсток суданської троянди і волошки, шматочків яблук, чорноплідної горобини і кірочок шипшини. Натуральний смак, який подарує Вам умиротворення в будь-який час!",
            "weight": 50,
            "price": 150,
        },
        {
            "image": "source/images/travyanaya-smes-khutorok-37703146637336-removebg-preview.png",
            "name": "Трав'яна суміш «Хуторок»",
            "description": "Натуральна трав'янась суміш, що містить кишмиш, пелюстки суданської троянди, скоринки шипшини, ягоди обліпихи, листя живокосту, малини, суниці та ожини, а також квіти безсмертника. Корисно і натурально!",
            "weight": 50,
            "price": 160,
        },
    ]

    context = {
        "title": "Каталог",
        "goods": res,
    }

    return render(
        request=request,
        template_name="goods/catalog.html",
        context=context,
    )


def product(request):
    return render(
        request=request,
        template_name="goods/product.html",
    )
